#!/usr/bin/env python
# encoding: utf-8


name_black_list = [u"NULL", u"NO", u"NBSP", u"公积金", u"企业自有", u"企业自筹", u"企业自有资金", u"个人投资", u"个人集资", u"个人股", u"内部职工股",
                   u"区属", u"县人民政府", u"合肥市老龄委员会", u"国务院", u"国家扶持基金", u"地区行署", u"地区（外经委）", u"增资", u"[档案缺失]", u"某某",
                   u"99999", u"22", u"张三", u"ghjgf", u"国有资金", u"000000", u"", u"市残联", u"见档案", u"转开福区", u"主办单位投入及自身积累",
                   u"固定资金", u"职工集资", u"建设局", u"14", u"市城北区青山街道办事处", u"解放办", u"交通局", u"个人自筹", u"镇企业办", u"工农办", u"企业局",
                   u"林业局", u"信用联社", u"金碧企业局", u"无限售流通股", u"县供销联社", u"其他", u"13", u"市粮食局", u"苍溪县邮政局", u"神泉镇企业办", u"县财政局",
                   u"转天心区", u"转雨花区", u"职工股", u"县商业局", u"本公司", u"财政局", u"本单位企业积累", u"市财政局", u"腾冲县工商局", u"企业自筹资金", u"国务院",
                   u"教育局", u"上级主管", u"无档案显示", u"法人股", u"企业自有", u"主办单位见原始档案", u"甘孜州邮政局", u"海头企业办", u"代办：市场建设管理服务中心",
                   u"(无主管企业)", u"B", u"县供销社", u"自筹", u"集体投资", u"村委会", u"个人投资", u"个人资本金", u"县乡镇经委", u"6", u"主办单位投入及企业积累",
                   u"1", u"集资", u"商业局", u"企业自有资金", u"市民政局", u"集体资金", u"积累", u"20", u"县经委", u"邮政局", u"职工集体股", u"寸金街道办",
                   u"市总工会", u"集体经济", u"自有", u"1", u"镇企办", u"主办单位投入及企业自身积累", u"新都金信", u"外经委", u"积累资金", u"国家股",
                   u"合肥市老龄委员会", u"社会法人股", u"城门镇企业办", u"新兴办", u"工会", u"企业自筹", u"企业自筹", u"乐乐乐", u"限售流通股", u"集体资本金",
                   u"县二轻局", u"供销社", u"市建委", u"其他股东增资", u"镇工业公司", u"射阳县教育局", u"爱国办", u"五华新村劳司", u"佳木斯市邮政局", u"海滨办",
                   u"21021021", u"乡工业公司", u"市商业局", u"白沙洲街道", u"职工合股基金会", u"英吉沙县国资局", u"集资", u"县社", u"国有股", u"集体出资",
                   u"临湘市经委", u"省外经委", u"主办部门投入及企业自身积累", u"乡企业办", u"旺苍县东河镇", u"二轻局", u"企业自有", u"农业局", u"无为县", u"中山企管办",
                   u"新兴街道办事处", u"县人民政府", u"农机局", u"国资局", u"企业历年积累", u"公司拔款", u"集体资产投资", u"市经委", u"职工", u"磁灶居委会",
                   u"专用基金", u"人民政府", u"主管", u"乡镇企业局", u"个人股", u"市供销社", u"县联社", u"国家", u"桃源县乡镇企业局", u"国有资产", u"榕华街道办事处",
                   u"曲溪镇企业管理办公室", u"个人股", u"国家资本金", u"民主企管办", u"上级拨款", u"陇县供销合作社", u"本单位积累", u"乡政府", u"市二轻局", u"国家资本",
                   u"上马墩街道办事处", u"国有资本", u"粮食局", u"无限售条件流通股", u"自筹", u"宜宾县邮政局", u"县乡镇企业局", u"内部职工股", u"香港", u"本企业积累",
                   u"职工集资", u"西马街道办事处", u"集体股", u"A", u"（企业自有）", u"其他股东", u"潮州市西新街道办事处新桥居委会", u"苏州市沧浪区商业局", u"国有资产管理局",
                   u"自有资金", u"关上办事处", u"个人集资", u"六合县六城镇人民政府", u"企业积累", u"义县供销合作社联合社", u"县粮食局", u"城关镇政府", u"区民政局",
                   u"国家投资", u"企业积累", u"泗阳县供销合作总社", u"12", u"汉寿县供销合作联社", u"企业自筹", u"市文化局", u"详见档案", u"昆明市盘龙区太和企业管理局",
                   u"有限售条件的流通股", u"达州市邮政局", u"沈阳市邮政局", u"医药总公司", u"昆明市第二轻工业局", u"市物资局", u"勃利县邮政局", u"社员股金", u"拨款",
                   u"主管单位见原始档案", u"集体股（由集体资产管理委员会持有）", u"有限售条件流通股", u"市城北区蒸湘街道办事处", u"昆明市盘龙区董家湾企业管理局", u"不详", u"本厂",
                   u"国家扶持基金", u"集体资本", u"潮州市西新街道办事处西新居委会", u"新民市农业生产资料公", u"企业办", u"忻府区粮食局", u"西站街道", u"50", u"无主管",
                   u"巩留县供销合作社联合社", u"无主管部门", u"衡东县乡镇企业局", u"食品公司", u"自筹", u"石河子市财政局", u"昭苏县供销合作社联合社", u"社会公众股", u"龙岗社区",
                   u"职工持股会", u"寸金企管办", u"村投资", u"县林业局", u"阿克苏地区", u"企业积累基金", u"无主管企业", u"建委", u"市交通局", u"集体自筹", u"镇政府",
                   u"无主", u"晋中市邮政局", u"16", u"其他单位2", u"海安县粮食局", u"企业专用基金", u"主管部门拨款", u"职工集资", u"集体共有股", u"本企业", u"股东",
                   u"物资局", u"国家投入", u"市机械局", u"村办", u"经委", u"公积金", u"喀什地区邮政局", u"集体所有", u"民政局", u"企业积累", u"国资委", u"股金",
                   u"国有资产", u"特殊类型企业请向登记机关查询", u"湘潭市雨湖区长城乡企业办公室", u"村经济合作社", u"庆城县人民政府金融工作办公室", u"中关村科技园区海淀园创业服务中心",
                   u"昆明市西山区黑林铺镇乡镇企业办公室", u"银行贷款", u"鄯善县人民政府乡镇企业管理局", u"五华大观三产办", u"城关镇", u"自筹", u"其他股东", u"其它", u"职工投资",
                   u"国家拨款", u"上级拨款", u"云锡劳服司", u"乌鲁木齐市邮政局", u"政府", u"区经委", u"县民政局", u"株洲市石峰区人民政府", u"友谊办",
                   u"集体股（集体资产管理委员会）", u"国有", u"乡投资", u"村委会", u"镇原县金融工作办公室", u"自筹资金", u"开原市光明街办事处", u"县物资局", u"增资",
                   u"昆明市盘龙区拓东企业管理局", u"工业局", u"市政府", u"市城北区五一街道办事处", u"先锋街道", u"有限售条件股份", u"职工个人股", u"县政府", u"乡企办",
                   u"15", u"上海", u"其他投资", u"国家扶持", u"金马办事处", u"集体", u"中华企业办", u"吊照数据补录", u"中国", u"桂平市财政局",
                   u"市城北区潇湘街道办事处", u"中山街道办事处", u"邳州市粮食局", u"企业积累资金", u"待甄别", u"无限售条件的流通股", u"5", u"海南省农垦总局", u"经贸委",
                   u"镇原县金融工作办公室", u"县农业局", u"昆明市西山区马街镇经济委员会", u"劳动服务公司", u"集体", u"市外经委", u"市公安局", u"雁峰街道",
                   u"营山县农村信用合作联社", u"企业局", u"市科委", u"拜城县供销联合社", u"文化局", u"本单位", u"牡丹江市邮政局", u"工业公司", u"昆明市盘龙区金碧企业管理局",
                   u"惠城镇企业办", u"职工自筹", u"县信用联社", u"水利局", u"建湖县粮食局", u"档案无显示", u"流动资金", u"董家湾企业局", u"修改数据", u"老库无名称",
                   u"主管部门", u"社会集资", u"自筹", u"计委", u"县交通局", u"衡南县乡镇企业", u"财政拨款", ]

BLK_INV_NAME = [u'流通股', u'自然人', u'职工股', u'公众股', u'法人股', u'发起人', u'其他股东', u'其它股东', u'-', u"上市", u"个人股", u"职工", u"其他股份"]
BLK_INV_TYPE_NAME = [u'流通股', u'自然人', u'职工股', u'公众股', u"个人股", u"职工"]
NOT_COM_END_INV = [u"委", u"店", u"所", u"院", u"校", u"园", u"部", u"厅", u"局", u"处",
                   u"室", u"站", u"社", u"会", u"中心", u"机构", u"合伙", u"场", u"吧", u"浴", u"馆", u"ktv", u"政府", u"国家"]


# 应该过滤掉为true,不应该过滤掉为false
def filter_inv_name(tmp_name):
    if tmp_name in name_black_list:
        return True

    return any(map(lambda _: _ in tmp_name, BLK_INV_NAME)) if tmp_name else True


# 应该过滤掉为true,不应该过滤掉为false
def filter_inv_type(tmp_name):
    return any(map(lambda _: _ in tmp_name, BLK_INV_TYPE_NAME)) if tmp_name else True


# 是公司返回true，不是公司返回false
def judge_com(tmp_name):
    return not any([_ for _ in NOT_COM_END_INV if tmp_name.endswith(_)])
