#!/usr/bin/env python
# encoding: utf-8


import sys
import re
reload(sys)
sys.setdefaultencoding('utf8')

_regCapCurPatternNum = re.compile('\d')
_regCapCurPatternDot = re.compile('\.')

cap_cur_mapping = {
    "004": u"阿富汗尼",
    "008": u"列克",
    "012": u"阿尔及利亚第纳尔",
    "020": u"安道尔比塞塔",
    "024": u"新克瓦查",
    "031": u"阿塞拜疆马纳特",
    "032": u"阿根廷比索",
    "036": u"澳大利亚元",
    "040": u"奥地利先令",
    "044": u"巴哈马元",
    "048": u"巴林第纳尔",
    "050": u"塔卡",
    "051": u"亚美尼亚达姆",
    "052": u"巴巴多斯元",
    "056": u"比利时法郎",
    "060": u"百慕大元",
    "064": u"努尔特鲁姆",
    "068": u"玻利维亚比索",
    "072": u"普拉",
    "084": u"伯里兹元",
    "090": u"所罗门群岛元",
    "096": u"文莱元",
    "100": u"列弗",
    "104": u"缅元",
    "108": u"布隆迪法郎",
    "112": u"白俄罗斯卢布",
    "116": u"柬埔寨瑞尔",
    "124": u"加元",
    "132": u"佛得角埃斯库多",
    "136": u"开曼群岛元",
    "144": u"斯里兰卡卢比",
    "152": u"智利比索",
    "156": u"人民币元",
    "170": u"哥伦比亚比索",
    "174": u"科摩罗法郎",
    "180": u"新扎伊尔",
    "188": u"哥斯达黎加科郎",
    "191": u"克罗地亚库纳",
    "192": u"古巴比索",
    "196": u"塞浦路斯镑",
    "203": u"捷克克朗",
    "208": u"丹麦克朗",
    "214": u"多米尼加比索",
    "218": u"苏克雷",
    "222": u"萨尔瓦多科郎",
    "230": u"埃塞俄比亚比尔",
    "233": u"克罗姆",
    "238": u"福克兰群岛镑",
    "242": u"斐济元",
    "246": u"芬兰马克",
    "250": u"法国法郎",
    "262": u"吉布提法郎",
    "270": u"达拉西",
    "280": u"德国马克",
    "288": u"塞地",
    "292": u"直布罗陀镑",
    "300": u"德拉克马",
    "320": u"格查尔",
    "324": u"几内亚法郎",
    "328": u"圭亚那元",
    "332": u"古德",
    "340": u"伦皮拉",
    "344": u"香港元",
    "348": u"福林",
    "352": u"冰岛克朗",
    "356": u"印度卢比",
    "360": u"卢比",
    "364": u"伊朗里亚尔",
    "368": u"伊拉克第纳尔",
    "372": u"爱尔兰镑",
    "376": u"锡克尔",
    "380": u"意大利里拉",
    "388": u"牙买加元",
    "392": u"日元",
    "398": u"坚戈",
    "400": u"约旦第纳尔",
    "404": u"肯尼亚先令",
    "408": u"北朝鲜圆",
    "410": u"韩国圆",
    "414": u"科威特第纳尔",
    "417": u"索姆",
    "418": u"基普",
    "422": u"黎巴嫩镑",
    "426": u"罗提",
    "428": u"拉脱维亚拉特",
    "430": u"利比里亚元",
    "434": u"利比亚第纳尔",
    "440": u"立陶宛",
    "442": u"卢森堡法郎",
    "446": u"澳门元",
    "450": u"马尔加什法郎",
    "454": u"克瓦查",
    "458": u"马来西亚林吉特",
    "462": u"卢菲亚",
    "470": u"马耳他里拉",
    "478": u"乌吉亚",
    "480": u"毛里求斯卢比",
    "484": u"墨西哥比索",
    "496": u"图格里克",
    "498": u"摩尔瓦多列伊",
    "504": u"摩洛哥迪拉姆",
    "508": u"麦梯卡尔",
    "512": u"阿曼里亚尔",
    "516": u"纳米比亚元",
    "524": u"尼泊尔卢比",
    "528": u"荷兰盾",
    "532": u"荷属安的列斯盾",
    "533": u"阿鲁巴盾",
    "548": u"瓦图",
    "554": u"新西兰元",
    "558": u"金科多巴",
    "566": u"奈拉",
    "578": u"挪威克朗",
    "586": u"巴基斯坦卢比",
    "590": u"巴波亚",
    "598": u"基那",
    "600": u"瓜拉尼",
    "604": u"索尔",
    "608": u"菲律宾比索",
    "616": u"兹罗提",
    "620": u"葡萄牙埃斯库多",
    "624": u"几内亚比绍比索",
    "626": u"东帝汶埃斯库多",
    "634": u"卡塔尔里亚尔",
    "642": u"列伊",
    "646": u"卢旺达法郎",
    "654": u"圣赫勒拿镑",
    "678": u"多布拉",
    "682": u"沙特里亚尔",
    "690": u"塞舌尔卢比",
    "694": u"利昂",
    "702": u"新加坡元",
    "703": u"斯洛伐克克朗",
    "704": u"越南盾",
    "705": u"托拉尔",
    "706": u"索马里先令",
    "710": u"兰特",
    "716": u"津巴布韦元",
    "724": u"西班牙比塞塔",
    "736": u"苏丹第纳尔",
    "740": u"苏里南盾",
    "748": u"里兰吉尼",
    "752": u"瑞典克朗",
    "756": u"瑞士法郎",
    "760": u"叙利亚镑",
    "762": u"塔吉克卢布",
    "764": u"泰国铢",
    "776": u"邦加",
    "780": u"特立尼达和多巴哥元",
    "784": u"UAE迪拉姆",
    "788": u"突尼斯第纳尔",
    "792": u"土耳其里拉",
    "795": u"马纳特",
    "800": u"乌干达先令",
    "804": u"库邦",
    "807": u"马其顿第纳尔",
    "810": u"俄罗斯卢布",
    "818": u"埃及镑",
    "826": u"英镑",
    "834": u"坦桑尼亚先令",
    "840": u"美元",
    "858": u"乌拉圭比索",
    "860": u"乌兹别克斯坦苏姆",
    "862": u"博利瓦",
    "882": u"塔拉",
    "886": u"也门里亚尔",
    "890": u"南斯拉夫第纳尔",
    "894": u"克瓦查",
    "901": u"新台湾元",
    "950": u"CFA法郎BEAC",
    "951": u"东加勒比元",
    "952": u"CFA法郎BCEAO",
    "953": u"CFP法郎",
    "954": u"欧元",
    "960": u"特别提款权",
    "983": u"UVC",
    "984": u"Mvdol",
    "985": u"兹罗提",
    "986": u"巴西瑞尔",
    "990": u"发展单位",
    "991": u"金融兰特",
}


_cap_cur_mapping_simple_to_code = dict(map(lambda __: (__[1], __[0].replace(u"元", "")), cap_cur_mapping.items()))


def parse_cap_cur_to_code(s):
    if not s:
        return ""

    if not isinstance(s, basestring):
        return u""

    s = _regCapCurPatternNum.sub(u"", s)
    s = _regCapCurPatternDot.sub(u"", s)
    s = s.replace(u"万", u"").strip()
    if len(s) > 10:
        return u""

    if u"港" in s:
        s = u"香港元"

    s_simple = s.replace(u"元", u"")
    s1 = _cap_cur_mapping_simple_to_code.get(s_simple, u"")
    if s1:
        return s1

    if not s1:
        for k, v in _cap_cur_mapping_simple_to_code.items():
            if s_simple in k or k in s_simple:
                return v

    return u""

if __name__ == '__main__':
    print parse_cap_cur_to_code(u"人民币")



